
#+PROPERTY: header-args:jupyter-python :kernel PROMICE_dev :session PROMICE-README :exports both
#+PROPERTY: header-args:bash :exports both

** L0 files

+ =raw= : All 10-minute data stored on the CF-card (external module on CR logger)
+ =SlimTableMem= : Hourly averaged 10-min data stored in the internal logger memory
+ =transmitted= : Transmitted via satellite. Only a subset of data is transmitted, and only hourly or daily average depending on station and day of year.

Level 0 files are stored in the =data/L0/<S>/= folder, where =<S>= is the station name. File names should encode the station, end-of-year of download, a version number if there are multiple files for a given year, and the format. Best practices would use the following conventions:  

=data/<L>/<S>/<S>_<Y>[.<n>]_<F>.txt=

Where 

+ =<L>= is the processing level
  + =<L>= must be one of the following: [L0, L1, L1A, L2, L3]
+ =<S>= is a station ID
  + =<S>= must be one of the following strings: [CEN, EGP, KAN_B, KAN_L, KAN_M, KAN_U, KPC_L, KPC_U, MIT, NUK_K, NUK_L, NUK_N, NUK_U, QAS_A, QAS_L, QAS_M, QAS_U, SCO_L, SCO_U, TAS_A, TAS_L, TAS_U, THU_L, THU_U, UPE_L, UPE_U]
+ =<Y>= is a four-digit year with a value greater than =2008=
  + =<Y>= should represent the year at the last timestamp in the file
  + Optionally, =.<n>= is a version number if multiple files from the same year are present
+ =<F>= is the format, one of =raw=, =TX=, or =STM=

Each L0 file that will be processed must have an entry in the TOML-formatted configuration file. The config file can be located anywhere, and the processing script receives the config file and the location of the L0 data. An [[./example.toml][example (template) L0 config file]] is:

#+BEGIN_SRC bash :results verbatim :exports results
cat example.toml
#+END_SRC

#+RESULTS:
#+begin_example
# EGP L0 config

station_id         = "EGP"
latitude           = 75.62
longitude          = -35.98
nodata             = ['-999', 'NAN'] # if one is a string, all must be strings
dsr_eng_coef       = 12.71  # from manufacturer to convert from eng units (1E-5 V) to  physical units (W m-2)
usr_eng_coef       = 12.71
dlr_eng_coef       = 12.71
ulr_eng_coef       = 12.71
hygroclip_t_offset = 0      # degrees C

columns = ["time", "rec", "min_y",
	"p", "t_1", "t_2", "rh", "wspd", "wdir", "wd_std",
	"dsr", "usr", "dlr", "ulr", "t_rad",
	"z_boom", "z_boom_q", "z_stake", "z_stake_q", "z_pt",
	"t_i_1", "t_i_2", "t_i_3", "t_i_4", "t_i_5", "t_i_6", "t_i_7", "t_i_8",
	"tilt_x", "tilt_y",
	"gps_time", "gps_lat", "gps_lon", "gps_alt", "gps_geoid", "gps_geounit", "gps_q", "gps_numsat", "gps_hdop",
	"t_log", "fan_dc", "batt_v_ss", "batt_v"]

["EGP_2016_raw.txt"]
format    = "raw"
skiprows  = 3

["EGP_2019_raw_transmitted.txt"]
skiprows = 0
format   = "TX"
columns = ["time", "rec",
	"p", "t_1", "t_2", "rh", "wspd", "wdir",
	"dsr", "usr", "dlr", "ulr", "t_rad",
	"z_boom", "z_stake", "z_pt",
	"t_i_1", "t_i_2", "t_i_3", "t_i_4", "t_i_5", "t_i_6", "t_i_7", "t_i_8",
	"tilt_x", "tilt_y",
	"gps_time", "gps_lat", "gps_lon", "gps_alt", "gps_hdop",
	"fan_dc", "batt_v"]
#+end_example

The TOML config file has the following expectations and behaviors:
+ Properties can be defined at the top level or under a section
+ Each file that will be processed gets its own section
+ Properties at the top level are copied to each section (assumed to apply to all files), but do not overwrite properties if they are already defined for a section.

In the example above,
+ The =station_id=, =latitude=, etc. properties are the same in both files (=EGP_2016_raw.txt= and =EGP_2019_raw_transmitted.txt=) and so they are defined once at the top of the file. They could have been defined in each of the sections similar to =hygroclip_t_offset=.
+ The =format= and =skiprows= properties are different in each section and defined in each section
+ The top-level defined =columns= is applied only to =EGP_2016_raw.txt= because it is defined differently in the =EGP_2019_raw_transmitted.txt= section.

*** L0 Reader

#+BEGIN_SRC jupyter-python :exports both
<<load_conf>>
<<read_L0>>

conf = load_conf("./data/L0/config/EGP_2016_raw.toml", "./data/L0")
ds = read_L0(conf[list(conf.keys())[0]])
print(ds)
#+END_SRC

#+RESULTS:
#+begin_example
<xarray.Dataset>
Dimensions:      (time: 10847)
Coordinates:
  ,* time         (time) datetime64[ns] 2016-05-01T14:30:00 ... 2016-07-19T17:...
Data variables:
    rec          (time) int64 51 52 53 54 55 ... 10893 10894 10895 10896 10897
    min_y        (time) int64 176540 176550 176560 ... 290460 290470 290480
    p            (time) float64 724.4 724.1 724.4 724.4 ... 730.8 731.2 730.7
    t_1          (time) float64 -20.1 -19.79 -19.31 ... -6.904 -6.904 -6.861
    t_2          (time) float64 -19.56 -19.11 -18.92 ... -6.866 -6.86 -6.799
    rh           (time) float64 54.1 51.7 50.23 49.51 ... 80.28 80.93 81.81
    wspd         (time) float64 1.062 0.918 0.636 0.486 ... 2.793 2.951 3.069
    wdir         (time) float64 265.1 259.2 216.8 208.4 ... 217.7 216.6 225.4
    wd_std       (time) float64 0.0 0.0 0.0 0.0 0.0 0.0 ... 0.0 0.0 0.0 0.0 0.0
    dsr          (time) float64 681.7 732.4 688.3 689.6 ... 724.7 711.4 698.8
    usr          (time) float64 518.6 559.3 531.8 534.4 ... 559.2 549.6 524.1
    dlr          (time) float64 -81.57 -102.0 -101.3 ... -135.8 -135.6 -132.4
    ulr          (time) float64 -23.97 -28.65 -33.92 ... -32.33 -32.52 -28.84
    t_rad        (time) float64 -12.78 -11.42 -9.929 ... -1.114 -1.03 -1.135
    z_boom       (time) float64 2.685 2.683 2.683 2.68 ... 2.583 2.584 2.58
    z_boom_q     (time) int64 190 192 189 187 191 191 ... 180 177 192 182 168
    z_stake      (time) float64 nan nan nan nan nan nan ... nan nan nan nan nan
    z_stake_q    (time) int64 0 0 0 0 0 0 0 0 0 0 0 0 ... 0 0 0 0 0 0 0 0 0 0 0
    z_pt         (time) float64 nan nan nan nan nan nan ... nan nan nan nan nan
    t_i_1        (time) float64 nan -109.0 -109.0 ... -8.478 -8.458 -8.448
    t_i_2        (time) float64 nan nan -109.0 -109.0 ... -9.67 -9.67 -9.67
    t_i_3        (time) float64 nan -109.0 -109.0 ... -8.879 -8.859 -8.849
    t_i_4        (time) float64 nan -109.0 -109.0 ... -10.74 -10.73 -10.74
    t_i_5        (time) float64 nan -109.0 -109.0 ... -12.67 -12.67 -12.67
    t_i_6        (time) float64 nan -109.0 nan -109.0 ... -14.9 -14.9 -14.9
    t_i_7        (time) float64 nan -109.0 -109.0 nan ... -17.16 -17.16 -17.16
    t_i_8        (time) float64 nan nan -109.0 nan ... -20.75 -20.76 -20.76
    tilt_x       (time) float64 3.527 3.492 3.516 3.489 ... 0.109 0.095 0.174
    tilt_y       (time) float64 -0.945 -0.938 -0.924 ... -0.828 -0.849 -0.859
    gps_time     (time) object nan nan nan ... 'GT170007.00' 'GT170007.00'
    gps_lat      (time) object nan nan nan ... 'NH7537.47563' 'NH7537.47563'
    gps_lon      (time) object nan nan nan ... 'WH03558.49655' 'WH03558.49655'
    gps_alt      (time) float64 nan nan nan ... 2.663e+03 2.663e+03 2.663e+03
    gps_geoid    (time) float64 nan nan nan nan nan ... 41.6 41.6 41.6 41.6 41.6
    gps_geounit  (time) object nan nan nan nan nan nan ... 'M' 'M' 'M' 'M' 'M'
    gps_q        (time) float64 nan nan nan nan nan nan ... 1.0 1.0 1.0 1.0 1.0
    gps_numsat   (time) float64 nan nan nan nan nan ... 11.0 12.0 12.0 12.0 12.0
    gps_hdop     (time) float64 nan nan nan nan nan ... 0.71 0.73 0.73 0.73 0.73
    t_log        (time) float64 -12.6 -12.08 -11.65 ... -1.801 -1.735 -1.5
    fan_dc       (time) float64 137.5 141.3 142.3 141.8 ... 123.5 123.9 124.1
    batt_v_ss    (time) float64 15.52 15.81 15.79 15.81 ... 14.47 14.47 14.47
    batt_v       (time) float64 15.23 15.56 15.53 15.63 ... 14.4 14.41 14.41
Attributes:
    format:              raw
    station_id:          EGP
    latitude:            75.62
    longitude:           -35.98
    nodata:              -999
    dsr_eng_coef:        12.71
    usr_eng_coef:        12.71
    dlr_eng_coef:        12.71
    ulr_eng_coef:        12.71
    hygroclip_t_offset:  0
    conf:                ./data/L0/config/EGP_2016_raw.toml
    file:                ./data/L0/EGP/EGP_2016_raw.txt
#+end_example


* Level 1
:PROPERTIES:
:header-args:bash+: :exports both
:END:

File list:

#+BEGIN_SRC bash :exports both :results verbatim
find ./data/L1
#+END_SRC

#+RESULTS:
#+begin_example
./data/L1
./data/L1/EGP
./data/L1/EGP/EGP-2017-STM.nc
./data/L1/EGP/EGP-2016-raw.nc
./data/L1/EGP/EGP-2019-TX.nc
./data/L1/EGP/EGP-2017-raw.nc
./data/L1/EGP/EGP-2019.1-raw.nc
./data/L1/EGP/EGP-2018.2-raw.nc
./data/L1/EGP/EGP-2018.1-raw.nc
./data/L1/EGP/EGP-2019.2-raw.nc
#+end_example

NetCDF format

#+BEGIN_SRC bash :results verbatim :exports both
ncdump -ch ./data/L1/EGP/EGP-2016-raw.nc | head -n35
#+END_SRC

#+RESULTS:
#+begin_example
netcdf EGP-2016-raw {
dimensions:
	time = 10847 ;
variables:
	double rec(time) ;
		rec:_FillValue = NaN ;
		rec:standard_name = "record" ;
		rec:long_name = "Record" ;
		rec:units = "" ;
		rec:scale_factor = 1. ;
		rec:add_offset = 0. ;
	double p(time) ;
		p:_FillValue = NaN ;
		p:standard_name = "air_pressure" ;
		p:long_name = "Air pressure" ;
		p:units = "hPa" ;
		p:scale_factor = 0.01 ;
		p:add_offset = 0. ;
	double t_1(time) ;
		t_1:_FillValue = NaN ;
		t_1:standard_name = "air_temperature" ;
		t_1:long_name = "Air temperature 1" ;
		t_1:units = "C" ;
		t_1:scale_factor = 1. ;
		t_1:add_offset = 273.15 ;
	double t_2(time) ;
		t_2:_FillValue = NaN ;
		t_2:standard_name = "air_temperature" ;
		t_2:long_name = "Air temperature 2" ;
		t_2:units = "C" ;
		t_2:scale_factor = 1. ;
		t_2:add_offset = 273.15 ;
	double rh(time) ;
		rh:_FillValue = NaN ;
		rh:standard_name = "relative_humidity" ;
#+end_example


*** Turbulent heat flux

+ GitHub: [[./IDL/AWSdataprocessing_v3.pro#L866]]
+ Org Mode: [[./IDL/AWSdataprocessing_v3.pro::866]]


+ Requires hourly averages

Constants

#+BEGIN_SRC jupyter-python
z_0    =    0.001    # aerodynamic surface roughness length for momention (assumed constant for all ice/snow surfaces)
eps    =    0.622
es_0   =    6.1071   # saturation vapour pressure at the melting point (hPa)
es_100 = 1013.246    # saturation vapour pressure at steam point temperature (hPa)
g      =    9.82     # gravitational acceleration (m/s2)
gamma  =   16.       # flux profile correction (Paulson & Dyer)
kappa  =    0.4      # Von Karman constant (0.35-0.42)
L_sub  =    2.83e6   # latent heat of sublimation (J/kg)
R_d    =  287.05     # gas constant of dry air
aa     =    0.7      # flux profile correction constants (Holtslag & De Bruin '88)
bb     =    0.75
cc     =    5.
dd     =    0.35
c_pd   = 1005.       # specific heat of dry air (J/kg/K)
WS_lim =    1.
L_dif_max = 0.01


T_0 = 273.15
T_100 = T_0+100            # steam point temperature in K

#+END_SRC

#+RESULTS:

#+BEGIN_SRC jupyter-python
# ds_h = ds.resample({'time':"1H"}).mean() # this takes ~2-3 minuteso

T_h = ds_h['t_1'].copy()
p_h = ds_h['p'].copy()
WS_h = ds_h['wspd'].copy()
Tsurf_h = ds_h['t_surf'].copy()
RH_cor_h = ds_h['rh_cor'].copy()

z_WS = ds_h['z_boom'].copy() + 0.4  # height of W
z_T = ds_h['z_boom'].copy() - 0.1   # height of thermometer

rho_atm = 100 * p_h / R_d / (T_h + T_0)   # atmospheric density

# dynamic viscosity of air (Pa s) (Sutherlands' equation using C = 120 K)
mu = 18.27e-6 * (291.15 + 120) / ((T_h + T_0) + 120) * ((T_h + T_0) / 291.15)**1.5

nu = mu / rho_atm                                                   # kinematic viscosity of air (m^2/s)
u_star = kappa * WS_h / np.log(z_WS / z_0)
Re = u_star * z_0 / nu
z_0h = z_0 * np.exp(1.5 - 0.2 * np.log(Re) - 0.11 * np.log(Re)**2) # rough surfaces: Smeets & Van den Broeke 2008
z_0h[WS_h <= 0] = 1e-10
es_ice_surf = 10**(-9.09718 * (T_0 / (Tsurf_h + T_0) -1) - 3.56654 * np.log10(T_0 / (Tsurf_h + T_0)) + 0.876793 * (1 - (Tsurf_h + T_0) / T_0) + np.log10(es_0))
q_surf = eps * es_ice_surf / (p_h - (1 - eps) * es_ice_surf)
# saturation vapour pressure above 0 C (hPa)
es_wtr = 10**(-7.90298 * (T_100 / (T_h + T_0) - 1) + 5.02808 * np.log10(T_100 / (T_h + T_0))
              - 1.3816E-7 * (10**(11.344 * (1 - (T_h + T_0) / T_100)) - 1)
              + 8.1328E-3 * (10**(-3.49149 * (T_100 / (T_h + T_0) -1)) - 1) + np.log10(es_100))
es_ice = 10**(-9.09718 * (T_0 / (T_h + T_0) - 1) - 3.56654 * np.log10(T_0 / (T_h + T_0)) + 0.876793 * (1 - (T_h + T_0) / T_0) + np.log10(es_0)) # saturation vapour pressure below 0 C (hPa)
q_sat = eps * es_wtr / (p_h - (1 - eps) * es_wtr) # specific humidity at saturation (incorrect below melting point)
freezing = T_h < 0  # replacing saturation specific humidity values below melting point
q_sat[freezing] = eps * es_ice[freezing] / (p_h[freezing] - (1 - eps) * es_ice[freezing])
q_h = RH_cor_h * q_sat / 100   # specific humidity in kg/kg
theta = T_h + z_T *g / c_pd
SHF_h = T_h
SHF_h[:] = 0
LHF_h = SHF_h
L = SHF_h + 1E5

stable = (theta > Tsurf_h) & (WS_h > WS_lim)
unstable = (theta < Tsurf_h) & (WS_h > WS_lim)
# no_wind  = (WS_h <= WS_lim)

for i in np.arange(0,31): # stable stratification
    psi_m1 = -(aa*         z_0/L[stable] + bb*(         z_0/L[stable]-cc/dd)*np.exp(-dd*         z_0/L[stable]) + bb*cc/dd)
    psi_m2 = -(aa*z_WS[stable]/L[stable] + bb*(z_WS[stable]/L[stable]-cc/dd)*np.exp(-dd*z_WS[stable]/L[stable]) + bb*cc/dd)
    psi_h1 = -(aa*z_0h[stable]/L[stable] + bb*(z_0h[stable]/L[stable]-cc/dd)*np.exp(-dd*z_0h[stable]/L[stable]) + bb*cc/dd)
    psi_h2 = -(aa* z_T[stable]/L[stable] + bb*( z_T[stable]/L[stable]-cc/dd)*np.exp(-dd* z_T[stable]/L[stable]) + bb*cc/dd)
    u_star[stable] = kappa*WS_h[stable]/(np.log(z_WS[stable]/z_0)-psi_m2+psi_m1)
    Re[stable] = u_star[stable]*z_0/nu[stable]
    z_0h[stable] = z_0*np.exp(1.5-0.2*np.log(Re[stable])-0.11*(np.log(Re[stable]))**2)
    # if n_elements(where(z_0h[stable] lt 1e-6)) gt 1 then z_0h[stable[where(z_0h[stable] lt 1e-6)]] = 1e-6
    z_0h[stable][z_0h[stable] < 1E-6] == 1E-6
    th_star = kappa*(theta[stable]-Tsurf_h[stable])/(np.log(z_T[stable]/z_0h[stable])-psi_h2+psi_h1)
    q_star  = kappa*(  q_h[stable]- q_surf[stable])/(np.log(z_T[stable]/z_0h[stable])-psi_h2+psi_h1)
    SHF_h[stable] = rho_atm[stable]*c_pd *u_star[stable]*th_star
    LHF_h[stable] = rho_atm[stable]*L_sub*u_star[stable]* q_star
    L_prev = L[stable]
    L[stable] = u_star[stable]**2*(theta[stable]+T_0)*(1+((1-eps)/eps)*q_h[stable])/(g*kappa*th_star*(1+((1-eps)/eps)*q_star))
    L_dif = np.abs((L_prev-L[stable])/L_prev)
    # print,"HF iterations stable stratification: ",i+1,n_elements(where(L_dif gt L_dif_max)),100.*n_elements(where(L_dif gt L_dif_max))/n_elements(where(L_dif))
    # if n_elements(where(L_dif gt L_dif_max)) eq 1 then break
    if np.all(L_dif <= L_dif_max):
        print("LDIF BREAK: ", i)
        break

if len(unstable) > 0:
    for i in np.arange(0,21):
        x1  = (1-gamma*z_0           /L[unstable])**0.25
        x2  = (1-gamma*z_WS[unstable]/L[unstable])**0.25
        y1  = (1-gamma*z_0h[unstable]/L[unstable])**0.5
        y2  = (1-gamma*z_T[unstable] /L[unstable])**0.5
        psi_m1 = np.log(((1+x1)/2)**2*(1+x1**2)/2)-2*np.arctan(x1)+np.pi/2
        psi_m2 = np.log(((1+x2)/2)**2*(1+x2**2)/2)-2*np.arctan(x2)+np.pi/2
        psi_h1 = np.log(((1+y1)/2)**2)
        psi_h2 = np.log(((1+y2)/2)**2)
        u_star[unstable] = kappa*WS_h[unstable]/(np.log(z_WS[unstable]/z_0)-psi_m2+psi_m1)
        Re[unstable] = u_star[unstable]*z_0/nu[unstable]
        z_0h[unstable] = z_0*np.exp(1.5-0.2*np.log(Re[unstable])-0.11*(np.log(Re[unstable]))**2)
        # if n_elements(where(z_0h[unstable] lt 1e-6)) gt 1 then z_0h[unstable[where(z_0h[unstable] lt 1e-6)]] = 1e-6
        z_0h[stable][z_0h[stable] < 1E-6] == 1E-6
        th_star = kappa*(theta[unstable]-Tsurf_h[unstable])/(np.log(z_T[unstable]/z_0h[unstable])-psi_h2+psi_h1)
        q_star  = kappa*(  q_h[unstable]- q_surf[unstable])/(np.log(z_T[unstable]/z_0h[unstable])-psi_h2+psi_h1)
        SHF_h[unstable] = rho_atm[unstable]*c_pd *u_star[unstable]*th_star
        LHF_h[unstable] = rho_atm[unstable]*L_sub*u_star[unstable]* q_star
        L_prev = L[unstable]
        L[unstable] = u_star[unstable]**2*(theta[unstable]+T_0)*(1+((1-eps)/eps)*q_h[unstable])/(g*kappa*th_star*(1+((1-eps)/eps)*q_star))
        L_dif = abs((L_prev-L[unstable])/L_prev)
        # print,"HF iterations unstable stratification: ",i+1,n_elements(where(L_dif gt L_dif_max)),100.*n_elements(where(L_dif gt L_dif_max))/n_elements(where(L_dif))
        # if n_elements(where(L_dif gt L_dif_max)) eq 1 then break
        if np.all(L_dif <= L_dif_max):
            print("LDIF BREAK: ", i)
            break

           
q_h = 1000 * q_h            # from kg/kg to g/kg
HF_nan = np.isnan(p_h) | np.isnan(T_h) | np.isnan(Tsurf_h) | np.isnan(RH_cor_h) | np.isnan(WS_h) | np.isnan(ds_h['z_boom'])
qh_nan = np.isnan(T_h) | np.isnan(RH_cor_h) | np.isnan(p_h) | np.isnan(Tsurf_h)
SHF_h[HF_nan] = np.nan
LHF_h[HF_nan] = np.nan
q_h[qh_nan] = np.nan

#+END_SRC

#+RESULTS:
: LDIF BREAK:  0
: LDIF BREAK:  0


** metadata.csv to TOML

Automatically generate v4 TOML files from the v3 metadata.csv files

#+BEGIN_SRC jupyter-python
import glob
import pandas as pd

mlist = glob.glob('./data/L0/metadata/*_metadata.csv')

rename = {'latitude_N(dd.ddddd)' : 'latitude',
          'longitude_W(dd.ddddd)' : 'longitude',
          'T_hygroclip_offset(C)' : 'hygroclip_t_offset',
          'SRin_calcoef' : 'dsr_eng_coef',
          'SRout_calcoef' : 'usr_eng_coef',
          'LRin_calcoef' : 'dlr_eng_coef',
          'LRout_calcoef' : 'ulr_eng_coef',
          'H_PT_calcoef' : 'pt_z_coef',
          'H_PT_p_cal' : 'pt_z_p_coef',
          'H_PT_factor' : 'pt_z_factor',
          'header_lines' : 'skiprows',
          'antifreeze_PT_(%)' : 'pt_antifreeze',
          'rotation_ini(deg)' : 'boom_azimuth',
          'col_minute_of_year' : 'min_y',
          'col_p' : 'p',
          'col_T' : 't_1',
          'col_T_hygroclip' : 't_2',
          'col_RH' : 'rh',
          'col_WS' : 'wspd',
          'col_WD' : 'wdir',
          'col_WD_sd' : 'wd_std',
          'col_SRin' : 'dsr',
          'col_SRout' : 'usr',
          'col_LRin' : 'dlr',
          'col_LRout' : 'ulr',
          'col_T_rad' : 't_rad',
          'col_H_aws' : 'z_boom',
          'col_qual_H_aws' : 'z_boom_q',
          'col_H_stk' : 'z_stake',
          'col_qual_H_stk' : 'z_stake_q',
          'col_H_pt' : 'z_pt',
          'col_Tice1' : 't_i_1',
          'col_Tice2' : 't_i_2',
          'col_Tice3' : 't_i_3',
          'col_Tice4' : 't_i_4',
          'col_Tice5' : 't_i_5',
          'col_Tice6' : 't_i_6',
          'col_Tice7' : 't_i_7',
          'col_Tice8' : 't_i_8',
          'col_ornt' : 'ORIENTATION',
          'col_tiltX' : 'tilt_x',
          'col_tiltY' : 'tilt_y',
          'col_GPStime' : 'gps_time',
          'col_GPSlat' : 'gps_lat',
          'col_GPSlon' : 'gps_lon',
          'col_GPSelev' : 'gps_alt',
          'col_GPSgeoid' : 'gps_geoid',
          'col_GPSqual' : 'gps_q',
          'col_GPSnumsats' : 'gps_numsats',
          'col_GPShdop' : 'gps_hdop',
          'col_Tlog' : 't_log',
          'col_Ifan' : 'fan_dc',
          'col_Vbat_ini' : 'batt_v_ss',
          'col_Vbat' : 'batt_v',
          'col_season' : 'SEASON'}


for md in mlist:
    df = pd.read_csv(md, index_col=0).rename(columns=rename)

    station = '_'.join(md.split("/")[-1].split("_")[:-1])
    out_file = open('./data/L0/config/' + station + '.toml', 'w')
    print(f"station_id = '{station}'", file=out_file)
    print("nodata     = ['-999', 'NAN'] # if one is a string, all must be strings\n", file=out_file)
          
    for f in df['filename']:
        ddf = df[df['filename'] == f].T
        if len(ddf.loc['filename']) == 0: continue
        if ddf.loc['filename'].values[0][-4:] != ".txt": continue

        print("['{}']".format(ddf.loc['filename'].values[0]), file=out_file)
        if 'transmitted' in str(ddf.loc['filename']):
            print("format     = 'TX'", file=out_file)
        elif 'SlimTable' in str(ddf.loc['filename']):
            print("format     = 'STM'", file=out_file)
        else:
            print("format     = 'raw'", file=out_file)

        for n in ['skiprows', 'latitude', 'longitude', 'hygroclip_t_offset', 'dsr_eng_coef', 'usr_eng_coef', 'dlr_eng_coef', 'ulr_eng_coef', 'pt_z_coef', 'pt_z_p_coef', 'pt_z_factor', 'pt_antifreeze', 'boom_azimuth']:
            print(n +  ' = {}'.format(np.round(ddf.loc[n].values[0],4)), file=out_file)

        cols = ddf.loc[['min_y','p', 't_1', 't_2', 'rh', 'wspd', 'wdir', 'wd_std', 'dsr', 'usr', 'dlr', 'ulr', 't_rad',
                        'z_boom', 'z_boom_q', 'z_stake', 'z_stake_q', 'z_pt', 't_i_1', 't_i_2', 't_i_3', 't_i_4',
                        't_i_5', 't_i_6', 't_i_7', 't_i_8', 'ORIENTATION', 'tilt_x', 'tilt_y', 'gps_time',
                        'gps_lat', 'gps_lon', 'gps_alt', 'gps_geoid', 'gps_q', 'gps_numsats', 'gps_hdop', 't_log',
                        'fan_dc', 'batt_v_ss', 'batt_v', 'SEASON']]
        cols.loc['rec'] = 2
        cols.loc['time'] = 1
        cols.columns = ['col']
        for i in np.arange(int(cols.max())):
            if i not in cols['col'].values:
                cols.loc['SKIP_' + str(i)] = i
        cols = cols.sort_values(by='col').replace(0,np.nan).dropna()
        print('columns = {}'.format(np.array2string(cols.index.values, separator=',', max_line_width=60)), file=out_file)
            
        # print('latitude   = {}'.format(str(ddf.loc['latitude'].values[0])), file=out_file)
        # print('longitude  = {}'.format(-ddf.loc['longitude'].values[0]), file=out_file)
        print('\n', file=out_file)
    out_file.close()

ddf    
#+END_SRC

#+RESULTS:
|                    |                              9 |
|--------------------+--------------------------------|
| filename           | TAS_A_2020_raw_transmitted.txt |
| slimtablemem?      |                             no |
| transmitted?       |                            yes |
| skiprows           |                              0 |
| data_lines         |                            884 |
| columns            |                             38 |
| year start         |                           2019 |
| latitude           |                          65.78 |
| longitude          |                           38.9 |
| UTC_offset(h)      |                              0 |
| hygroclip_t_offset |                              0 |
| dsr_eng_coef       |                          14.15 |
| usr_eng_coef       |                          12.97 |
| dlr_eng_coef       |                          10.23 |
| ulr_eng_coef       |                          13.47 |
| pt_z_coef          |                          0.407 |
| pt_z_p_coef        |                          982.1 |
| pt_z_factor        |                            2.5 |
| pt_antifreeze      |                             50 |
| boom_azimuth       |                              0 |
| col_datetime       |                              1 |
| col_date           |                              0 |
| col_year           |                              0 |
| col_month          |                              0 |
| col_day            |                              0 |
| col_day_of_year    |                              0 |
| col_time           |                              0 |
| col_hour           |                              0 |
| col_minute         |                              0 |
| min_y              |                              0 |
| p                  |                              3 |
| t_1                |                              4 |
| t_2                |                              5 |
| rh                 |                              6 |
| wspd               |                              7 |
| wdir               |                              8 |
| wd_std             |                              0 |
| dsr                |                              9 |
| usr                |                             10 |
| dlr                |                             11 |
| ulr                |                             12 |
| t_rad              |                             13 |
| z_boom             |                             14 |
| z_boom_q           |                              0 |
| z_stake            |                             15 |
| z_stake_q          |                              0 |
| z_pt               |                             16 |
| t_i_1              |                             17 |
| t_i_2              |                             18 |
| t_i_3              |                             19 |
| t_i_4              |                             20 |
| t_i_5              |                             21 |
| t_i_6              |                             22 |
| t_i_7              |                             23 |
| t_i_8              |                             24 |
| ORIENTATION        |                              0 |
| tilt_x             |                             25 |
| tilt_y             |                             26 |
| gps_time           |                             27 |
| gps_lat            |                             28 |
| gps_lon            |                             29 |
| gps_alt            |                             30 |
| gps_geoid          |                              0 |
| gps_q              |                              0 |
| gps_numsats        |                              0 |
| gps_hdop           |                             31 |
| t_log              |                              0 |
| fan_dc             |                             32 |
| batt_v_ss          |                              0 |
| batt_v             |                             33 |
| SEASON             |                              0 |

** Compare 2

#+BEGIN_SRC jupyter-python
import numpy as np
import pandas as pd
import xarray as xr

station='QAS_L'

# if 'idl' in locals(): del(idl)
if 'df' in locals(): del(df)

def mydf(y,m,d,h):
    return pd.to_datetime(y+'-'+m+'-'+d+':'+h, format='%Y-%m-%d:%H')

## HOUR
idl = pd.read_csv("./test_QAS/processed_data/"+station+"_hour_v03.txt",
                  delimiter="\s+",
                  parse_dates={'time':[0,1,2,3]},
                  infer_datetime_format=True,
                  date_parser=mydf,
                  index_col=0)

idl = idl.drop(columns=['DayOfYear'])\
         .replace(-999, np.nan)\
         .apply(pd.to_numeric, errors='coerce')\
         .dropna(how='all')\
         .rename(columns={'AirPressure(hPa)' : 'p',
                          'AirTemperature(C)' : 't_1',
                          'AirTemperatureHygroClip(C)' : 't_2',
                          'RelativeHumidity(%)' : 'rh_cor',
                          'SpecificHumidity(g/kg)' : 'rh_cor2',
                          'WindSpeed(m/s)' : 'wspd',
                          'WindDirection(d)' : 'wdir',
                          'SensibleHeatFlux(W/m2)' : 'shf',
                          'LatentHeatFlux(W/m2)' : 'lhf',
                          'ShortwaveRadiationDown(W/m2)': 'dsr',
                          'ShortwaveRadiationDown_Cor(W/m2)' : 'dsr_cor',
                          'ShortwaveRadiationUp(W/m2)' : 'usr',
                          'ShortwaveRadiationUp_Cor(W/m2)' : 'usr_cor',
                          'Albedo_theta<70d' : 'albedo',
                          'Albedo' : 'albedo',
                          'LongwaveRadiationDown(W/m2)' : 'dlr',
                          'LongwaveRadiationUp(W/m2)' : 'ulr',
                          'CloudCover' : 'cc',
                          'SurfaceTemperature(C)' : 't_surf',
                          'HeightSensorBoom(m)' : 'z_boom',
                          'HeightStakes(m)': 'z_stake',
                          'DepthPressureTransducer(m)' : 'z_pt',
                          'DepthPressureTransducer_Cor(m)' : 'z_pt_cor',
                          'IceTemperature1(C)' : 't_i_1',
                          'IceTemperature2(C)' : 't_i_2',
                          'IceTemperature3(C)' : 't_i_3',
                          'IceTemperature4(C)' : 't_i_4',
                          'IceTemperature5(C)' : 't_i_5',
                          'IceTemperature6(C)' : 't_i_6',
                          'IceTemperature7(C)' : 't_i_7',
                          'IceTemperature8(C)' : 't_i_8',
                          'TiltToEast(d)' : 'tilt_x',
                          'TiltToNorth(d)' : 'tilt_y',
                          'TimeGPS(hhmmssUTC)' : 'gps_t',
                          'LatitudeGPS(degN)' : 'gps_lat',
                          'LongitudeGPS(degW)' : 'gps_lon',
                          'ElevationGPS(m)' : 'gps_alt',
                          'HorDilOfPrecGPS' : 'gps_hdop',
                          'LoggerTemperature(C)' : 't_logger',
                          'FanCurrent(mA)' : 'fan_dc',
                          'BatteryVoltage(V)' : 'batt_v'})


    
df = pd.read_csv("./test_QAS/L3/"+station+"/"+station+"-TX_hour.csv",
                 index_col=0, parse_dates=True)


# subset to same columns
subset = np.intersect1d(df.columns, idl.columns)
df = df[subset]
idl = idl[subset]

df = df['2021-10-22':'2021-10-28']
idl = idl['2021-10-22':'2021-10-28']

err = df - idl # need to understand data to understand error
err_pct = (err / idl.mean(axis='rows'))*100 # % err but should work as long as mean != 0
# err = (df - idl) / idl*100 # % err: large errors when values near 0
# err = (df - idl) / idl.mean(axis='rows')*100 # % err but should work as long as mean != 0

pd.options.display.float_format = "{:,.5f}".format

err_desc = err.describe().T.drop(columns="count")
err_pct_desc = err_pct.describe().T.drop(columns="count")

# diff_pct.plot()
# diff_pct.replace(0,np.nan).dropna(how='all', axis='columns').plot()
def plot_diff(df,idl,err,err_pct,var):
    import matplotlib.pyplot as plt
    fig = plt.figure(1)
    fig.clf()
    ax1 = fig.add_subplot(211)
    err[var].plot(label='err', color='red', marker='.', ax=ax1, linewidth=2)
    ax1.set_ylim(ax1.get_ylim()[0]*1.3, ax1.get_ylim()[1])
    ax1.set_ylabel("Err [units]")
    ax1_pct = ax1.twinx()
    err_pct[var].plot(label='err', color='black', marker='.', ax=ax1_pct, linewidth=0.5)
    ax1_pct.set_ylabel("Err [%]")
    # ax1.spines['left'].set_color('red')
    ax1.tick_params(axis='y', colors='red')
    ax1.yaxis.label.set_color('red')
    ax1.title.set_color('red')
    
    ax2 = fig.add_subplot(212, sharex=ax1)
    idl[var].plot(label='IDL '+var, linewidth=3, ax=ax2, marker='.', markersize=4)
    df[var].plot(label='Py '+var, ax=ax2, marker='.', markersize=3)
    ax2.set_ylabel(var + " [units]")
    # (df[var]*0).plot(color='k', linestyle='--', ax=ax2, alpha=0.25, label='', marker='.')
    legend()
    
var = 'wspd'; plot_diff(df,idl,err,err_pct,var)

# # err_desc
# # err_pct_desc
desc = err_desc.round(3).astype("string")
desc = desc + " (" + err_pct_desc.replace(np.nan,0).round().astype(int).astype("string") + ")"
desc

if __name__ == "__main__":
    print(desc.drop(columns=['std']))

#+END_SRC

#+RESULTS:
#+begin_example
                  mean            min         25%         50%        75%          max
albedo            <NA>           <NA>        <NA>        <NA>       <NA>         <NA>
batt_v         0.0 (0)        0.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)      0.0 (0)
cc          -0.001 (0)    -0.17 (-34)     0.0 (0)     0.0 (0)    0.0 (0)    0.18 (36)
dlr          0.092 (0)    -13.79 (-5)   -0.03 (0)     0.0 (0)   0.03 (0)    18.32 (7)
dsr         -0.084 (0)  -59.49 (-144)   -0.03 (0)     0.0 (0)   0.03 (0)  71.08 (172)
dsr_cor           <NA>           <NA>        <NA>        <NA>       <NA>         <NA>
fan_dc         0.0 (0)        0.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)      0.0 (0)
gps_alt        0.0 (0)        0.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)      0.0 (0)
gps_hdop       0.0 (0)        0.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)      0.0 (0)
gps_lat     -0.001 (0)     -0.001 (0)  -0.001 (0)  -0.001 (0)   -0.0 (0)     -0.0 (0)
gps_lon        0.0 (0)        0.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)    0.001 (0)
p           -0.024 (0)       -1.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)      1.0 (0)
rh_cor      -0.109 (0)    -8.63 (-12)   -0.03 (0)     0.0 (0)   0.02 (0)    7.51 (11)
t_1        0.034 (-84)  -0.06 (-1843)     0.0 (0)     0.0 (0)    0.0 (0)   0.75 (147)
t_2       0.032 (-128)  -0.27 (-3164)     0.0 (0)     0.0 (0)    0.0 (0)  0.78 (1095)
t_i_1          0.0 (0)        0.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)      0.0 (0)
t_i_2       -0.001 (1)      -0.01 (0)     0.0 (0)     0.0 (0)    0.0 (0)     0.0 (13)
t_i_3          0.0 (0)        0.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)      0.0 (0)
t_i_4       -0.001 (2)    -0.01 (-16)     0.0 (0)     0.0 (0)    0.0 (0)    0.01 (16)
t_i_5          0.0 (0)        0.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)      0.0 (0)
t_i_6          0.0 (0)        0.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)      0.0 (0)
t_i_7          0.0 (0)        0.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)      0.0 (0)
t_i_8          0.0 (0)        0.0 (0)     0.0 (0)     0.0 (0)    0.0 (0)      0.0 (0)
t_surf       0.008 (0)    -0.23 (-44)     0.0 (0)     0.0 (0)    0.0 (0)    0.87 (12)
tilt_x      -0.101 (3)      -0.72 (0)     0.0 (0)     0.0 (0)    0.0 (0)     0.0 (18)
tilt_y     -0.109 (-4)    -0.71 (-27)     0.0 (0)     0.0 (0)    0.0 (0)      0.0 (0)
ulr          0.079 (0)      -1.32 (0)   -0.03 (0)    0.01 (0)   0.03 (0)     4.37 (1)
usr        -0.147 (-1)  -24.83 (-243)   -0.03 (0)     0.0 (0)   0.02 (0)   15.7 (153)
usr_cor           <NA>           <NA>        <NA>        <NA>       <NA>         <NA>
wdir          5.54 (5)   -12.28 (-11)   -0.02 (0)     0.0 (0)   0.01 (0)  316.5 (289)
wspd       -0.032 (-1)    -1.39 (-37)     0.0 (0)     0.0 (0)    0.0 (0)    1.62 (44)
z_boom       0.002 (0)     -0.004 (0)    -0.0 (0)   0.003 (0)  0.003 (0)    0.005 (0)
z_pt        -0.001 (0)     -0.005 (0)  -0.005 (0)  -0.004 (0)  0.005 (0)    0.005 (0)
z_stake        0.0 (0)     -0.004 (0)     0.0 (0)     0.0 (0)  0.001 (0)    0.003 (0)
#+end_example
